# -*- eval: (load-library "elot-defaults") -*-
#+title: DOLCE-Lite.owl ontology
#+subtitle: An OWL ontology
#+author: 
#+date: WIP (version of 2025-04-11 20:57)
#+call: theme-readtheorg()

# This org-mode file was created using elot-exporter version 0.6-SNAPSHOT.
# Source ontology: [Local File] DOLCE-Lite.owl.omn

# Change the output file location by editing the :header-args:omn: :tangle property below.

*** select query
#+begin_src sparql :url "DOLCE-Lite.owl.omn"
  select ?class ?label {
    ?class a owl:Class ; rdfs:label ?label
    filter not exists { 
      ?class rdfs:subClassOf/rdfs:subClassOf/rdfs:subClassOf ?x }
  } order by ?class
#+end_src

#+RESULTS:
| class                       | label                      |
|-----------------------------+----------------------------|
| :abstract                   | abstract                   |
| :endurant                   | endurant                   |
| :particular                 | particular                 |
| :perdurant                  | perdurant                  |
| :proposition                | proposition                |
| :quality                    | quality                    |
| :region                     | region                     |
| :set                        | set                        |
| :spatio-temporal-particular | spatio-temporal-particular |
